wedgeConeNose/0/include/variables
flowVelocity           (20 0 0);
pressure               0;
turbulentKE            0.24;
turbulentOmega         1.78;
